export const PLANS = {
    SINGLE: 'Один человек',
    COUPLE: 'Пара',
    FAMILY: 'Семья',
};

export const DURATION = {
    ONE: '1 год',
    TWO: '2 года',
};

export function selectPricePlan(duration: string, plan: string) {
    return planData[duration]?.[plan] ?? null;
}

const planData = {
    [DURATION.ONE]: {
        [PLANS.SINGLE]: {
            planName: "Стандартная защита",
            persons: 1,
            fullTermPrice: 11880,
            listItems: ['Удаление неограниченного количество псевдонимов и адресов электронной почты', 'Маскировка электронной почты и телефона', 'Персональные запросы на удаление + услуги по автоматизации', 'Поддержка по электронной почте, телефону и в чате'],
        },
        [PLANS.COUPLE]: {
            planName: 'Двойная защита',
            persons: 2,
            fullTermPrice: 19080,
            listItems: ['Удаление неограниченного количество псевдонимов и адресов электронной почты для 2 человек', 'Маскировка электронной почты и телефона', 'Персональные запросы на удаление + услуги по автоматизации', 'Поддержка по электронной почте, телефону и в чате'],
        },
        [PLANS.FAMILY]: {
            planName: 'Семейная защита',
            persons: 4,
            fullTermPrice: 27480,
            listItems: ['Удаление неограниченного количество псевдонимов и адресов электронной почты для 4 человек', 'Маскировка электронной почты и телефона', 'Персональные запросы на удаление + услуги по автоматизации', 'Поддержка по электронной почте, телефону и в чате'],
        },
    },
    [DURATION.TWO]: {
        [PLANS.SINGLE]: {
            planName: 'Ультра защита',
            persons: 1,
            fullTermPrice: 18960,
            listItems: ['Удаление неограниченного количество псевдонимов и адресов электронной почты', 'Маскировка электронной почты и телефона', 'Персональные запросы на удаление + услуги по автоматизации', 'Поддержка по электронной почте, телефону и в чате'],
        },
        [PLANS.COUPLE]: {
            planName: 'Ультра двойная защита',
            persons: 2,
            fullTermPrice: 28560,
            listItems: ['Удаление неограниченного количество псевдонимов и адресов электронной почты для 2 человек', 'Маскировка электронной почты и телефона', 'Персональные запросы на удаление + услуги по автоматизации', 'Поддержка по электронной почте, телефону и в чате'],
        },
        [PLANS.FAMILY]: {
            planName: 'Семейная защита ультра',
            persons: 4,
            fullTermPrice: 45360,
            listItems: ['Удаление неограниченного количество псевдонимов и адресов электронной почты для 4 человек', 'Маскировка электронной почты и телефона', 'Персональные запросы на удаление + услуги по автоматизации', 'Поддержка по электронной почте, телефону и в чате'],
        },
    },
};
